# PhyMaterialParamThermalConductivityX Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PhyMaterialParamThermalConductivityX Property
ParameterTypeId Class See Also
---
"Thermal Conductivity X"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PhyMaterialParamThermalConductivityX { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PhyMaterialParamThermalConductivityX As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PhyMaterialParamThermalConductivityX {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace